In [1]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 2.3 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [2]:
import pymysql
import pandas

In [3]:
con=pymysql.connect(host='mysql-ethan-python-mysql.h.aivencloud.com',port=10413,user='praffull',password='AVNS_owESNvPFD5fnVDwuWUq',database='sharayudb')
print('python connected to cloud mysql database successfully')

python connected to cloud mysql database successfully

In [4]:
dfcust=pandas.read_sql("select * from customers",con)
dfcars=pandas.read_sql("select * from cars",con)

<ipython-input-4-3237978650>:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dfcust=pandas.read_sql("select * from customers",con)
<ipython-input-4-3237978650>:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dfcars=pandas.read_sql("select * from cars",con)

In [5]:
print(dfcust)

    custno                 custnm         city  carid      paymode
0        1               Joe Root       london  sk181   netbanking
1        2           Boris Becker       berlin  ho162         cash
2        3     Michael Schumacher       berlin  bm201  credit card
3        4  Arnold Schwarzenegger   los angles  to191  credit card
4        5            Jos Buttler   manchester  vw173  credit card
5        6       Rebecca Ferguson     new york  bm185   netbanking
6        7            Steffi Graf    stuttgart  vw171   debit card
7        8           Keanu Reeves        tokyo  to191  credit card
8        9       Sabastian Vettel   heppenheim  sk183  credit card
9       10             Tom Cruise      chicago  bm201         cash
10      11          Roger Federer    amsterdam  ho161  credit card
11      12            Emily Blunt       london  vw172  credit card
12      13         Shah Rukh Khan    new delhi  tt153   debit card
13      14             A R Rahman      chennai  hd142         cash
14      15                   Tabu    hyderabad  vw173   debit card
15      16           Shabana Azmi       mumbai  ss210   debit card
16      17                  Rekha      chennai  hd141         cash
17      18       Amitabh Bachchan    allahabad  cs682         cash
18      19             Imran Khan       lahore  to191   netbanking
19      20           Dipika Singh       mumbai  to193   netbanking
20      21              Alia Bhat      lucknow  hd142         cash
21      22        Serena Williams     new york  ss210   netbanking
22      23         Max Verstappen       berlin  rb739         cash
23      24        Charles Leclerc  monte carlo  fr133   debit card
24      25     Sylvester Stallone      Kolkata  ms134         cash
25      26            Emily Blunt         Agra  ms131   netbanking

In [6]:
print(dfcars)

    carid       modelnm        company       price
0   bm201            XM            BMW  12500000.0
1   bm202            X1            BMW   4145000.0
2   hd141         Venue        Hyundai    753000.0
3   hd142         Creta        Hyundai   1044000.0
4   hd143           i20        Hyundai    707000.0
5   hd144           i10        Hyundai    542000.0
6   ho161          City          Honda    950000.0
7   ho162         Amaze          Honda    665000.0
8   ms131         Swift  Maruti Suzuki    591000.0
9   ms132  Grand Vitara  Maruti Suzuki   1035000.0
10  ms133        Brezza  Maruti Suzuki    799000.0
11  ms134        Baleno  Maruti Suzuki    642000.0
12  ms135        WagonR  Maruti Suzuki    547000.0
13  sk181        Kushaq          Skoda   1158000.0
14  sk182        Superb          Skoda   3416000.0
15  sk183        Kodiaq          Skoda   3749000.0
16  to191      Fortuner         Toyota   3258000.0
17  to192        Glanza         Toyota    659000.0
18  to193        Innova         Toyota   1809000.0
19  tt151         Nexon           Tata    769000.0
20  tt152         Punch           Tata    600000.0
21  tt153        Safari           Tata   1545000.0
22  vw171        Virtus     Volkswagen   1132000.0
23  vw172        Taigun     Volkswagen   1256000.0
24  vw173        Tiguan     Volkswagen   3375000.0

In [8]:
res=dfcust.merge(dfcars,on="carid",how="inner")
print(res[['custnm','city','modelnm','company','price']])

                   custnm        city   modelnm        company       price
0                Joe Root      london    Kushaq          Skoda   1158000.0
1            Boris Becker      berlin     Amaze          Honda    665000.0
2      Michael Schumacher      berlin        XM            BMW  12500000.0
3   Arnold Schwarzenegger  los angles  Fortuner         Toyota   3258000.0
4             Jos Buttler  manchester    Tiguan     Volkswagen   3375000.0
5             Steffi Graf   stuttgart    Virtus     Volkswagen   1132000.0
6            Keanu Reeves       tokyo  Fortuner         Toyota   3258000.0
7        Sabastian Vettel  heppenheim    Kodiaq          Skoda   3749000.0
8              Tom Cruise     chicago        XM            BMW  12500000.0
9           Roger Federer   amsterdam      City          Honda    950000.0
10            Emily Blunt      london    Taigun     Volkswagen   1256000.0
11         Shah Rukh Khan   new delhi    Safari           Tata   1545000.0
12             A R Rahman     chennai     Creta        Hyundai   1044000.0
13                   Tabu   hyderabad    Tiguan     Volkswagen   3375000.0
14                  Rekha     chennai     Venue        Hyundai    753000.0
15             Imran Khan      lahore  Fortuner         Toyota   3258000.0
16           Dipika Singh      mumbai    Innova         Toyota   1809000.0
17              Alia Bhat     lucknow     Creta        Hyundai   1044000.0
18     Sylvester Stallone     Kolkata    Baleno  Maruti Suzuki    642000.0
19            Emily Blunt        Agra     Swift  Maruti Suzuki    591000.0

In [9]:
res=dfcust.merge(dfcars,on="carid",how="left")
print(res[['custnm','city','modelnm','company','price']])

                   custnm         city   modelnm        company       price
0                Joe Root       london    Kushaq          Skoda   1158000.0
1            Boris Becker       berlin     Amaze          Honda    665000.0
2      Michael Schumacher       berlin        XM            BMW  12500000.0
3   Arnold Schwarzenegger   los angles  Fortuner         Toyota   3258000.0
4             Jos Buttler   manchester    Tiguan     Volkswagen   3375000.0
5        Rebecca Ferguson     new york       NaN            NaN         NaN
6             Steffi Graf    stuttgart    Virtus     Volkswagen   1132000.0
7            Keanu Reeves        tokyo  Fortuner         Toyota   3258000.0
8        Sabastian Vettel   heppenheim    Kodiaq          Skoda   3749000.0
9              Tom Cruise      chicago        XM            BMW  12500000.0
10          Roger Federer    amsterdam      City          Honda    950000.0
11            Emily Blunt       london    Taigun     Volkswagen   1256000.0
12         Shah Rukh Khan    new delhi    Safari           Tata   1545000.0
13             A R Rahman      chennai     Creta        Hyundai   1044000.0
14                   Tabu    hyderabad    Tiguan     Volkswagen   3375000.0
15           Shabana Azmi       mumbai       NaN            NaN         NaN
16                  Rekha      chennai     Venue        Hyundai    753000.0
17       Amitabh Bachchan    allahabad       NaN            NaN         NaN
18             Imran Khan       lahore  Fortuner         Toyota   3258000.0
19           Dipika Singh       mumbai    Innova         Toyota   1809000.0
20              Alia Bhat      lucknow     Creta        Hyundai   1044000.0
21        Serena Williams     new york       NaN            NaN         NaN
22         Max Verstappen       berlin       NaN            NaN         NaN
23        Charles Leclerc  monte carlo       NaN            NaN         NaN
24     Sylvester Stallone      Kolkata    Baleno  Maruti Suzuki    642000.0
25            Emily Blunt         Agra     Swift  Maruti Suzuki    591000.0

In [10]:
res=dfcust.merge(dfcars,on="carid",how="right")
print(res[['custnm','city','modelnm','company','price']])

                   custnm        city       modelnm        company       price
0      Michael Schumacher      berlin            XM            BMW  12500000.0
1              Tom Cruise     chicago            XM            BMW  12500000.0
2                     NaN         NaN            X1            BMW   4145000.0
3                   Rekha     chennai         Venue        Hyundai    753000.0
4              A R Rahman     chennai         Creta        Hyundai   1044000.0
5               Alia Bhat     lucknow         Creta        Hyundai   1044000.0
6                     NaN         NaN           i20        Hyundai    707000.0
7                     NaN         NaN           i10        Hyundai    542000.0
8           Roger Federer   amsterdam          City          Honda    950000.0
9            Boris Becker      berlin         Amaze          Honda    665000.0
10            Emily Blunt        Agra         Swift  Maruti Suzuki    591000.0
11                    NaN         NaN  Grand Vitara  Maruti Suzuki   1035000.0
12                    NaN         NaN        Brezza  Maruti Suzuki    799000.0
13     Sylvester Stallone     Kolkata        Baleno  Maruti Suzuki    642000.0
14                    NaN         NaN        WagonR  Maruti Suzuki    547000.0
15               Joe Root      london        Kushaq          Skoda   1158000.0
16                    NaN         NaN        Superb          Skoda   3416000.0
17       Sabastian Vettel  heppenheim        Kodiaq          Skoda   3749000.0
18  Arnold Schwarzenegger  los angles      Fortuner         Toyota   3258000.0
19           Keanu Reeves       tokyo      Fortuner         Toyota   3258000.0
20             Imran Khan      lahore      Fortuner         Toyota   3258000.0
21                    NaN         NaN        Glanza         Toyota    659000.0
22           Dipika Singh      mumbai        Innova         Toyota   1809000.0
23                    NaN         NaN         Nexon           Tata    769000.0
24                    NaN         NaN         Punch           Tata    600000.0
25         Shah Rukh Khan   new delhi        Safari           Tata   1545000.0
26            Steffi Graf   stuttgart        Virtus     Volkswagen   1132000.0
27            Emily Blunt      london        Taigun     Volkswagen   1256000.0
28            Jos Buttler  manchester        Tiguan     Volkswagen   3375000.0
29                   Tabu   hyderabad        Tiguan     Volkswagen   3375000.0